// import React from "react";

// const MyComponent = React.memo(
//     (props) => {
    
//     },
//     (prevProps, nextProps) => {
//       // თუ ორივე პროპსი ერთნაირია, არ განახლდება
//       return prevProps.value === nextProps.value;
//     }
//   );

  // მემოს მეორე არგუმენტი არის ფუნქცია, რომელიც იღებს კომპონენტის ძველ და ახალ პროპერტებს და აბრუნებს true ან false:

  //true ნიშნავს რომ ახალი პროპერტები ისეთივეა და არარის საჭირო რენდერინგი
  
  //false ი თუ არის ესეიგი  ახალი პროპერტები განსხვავდება და მოხდება რერენდერი,